In [7]:
import pandas as pd
import numpy as np

In [2]:
students = pd.read_csv("student_records_dirty.csv")

In [3]:
students.head()

,student_id,first_name,last_name,age,major,enrollment_date,course_grade,gpa,tuition_paid
0,17270,Taylor,Chen,23,Bio,2024-02-28,12,3.8,17548.10
1,10860,Olivia,Martinez,73,Computer Science,"January 30, 2024",12,2.7,13129.13
2,15390,Priya,Garcia,52,bio,2024-02-10,95,1.9,19051.36
3,15191,Priya,Anderson,61,CS,2024-02-08,3,2.0,17242.61
4,15734,Noah,Wilson,36,Comp Sci,"February 08, 2024",-20,3.2,NaN

In [4]:
students.shape

(355, 9)

In [5]:
students.sample(5)

,student_id,first_name,last_name,age,major,enrollment_date,course_grade,gpa,tuition_paid
327,11895,Evan,Johnson,46,PSYCH,"January 07, 2024",12,1.9,18889.72
268,16944,Emma,Clark,82,Bio,2024-05-06,52,NaN,20000.00
247,11154,EMMA,Davis,52,Psychology,"May 29, 2024",0,NaN,18085.33
65,14297,Jamie,Clark,32,Psych,"February 29, 2024",100,3.5,16603.71
176,17280,Emma,Smith,56,BIO,2024-04-10,52,NaN,20000.00

In [12]:
students['course_grade'].value_counts(dropna=False)

course_grade
100         36
12          34
NaN         32
 ninety     32
95          27
-20         27
0           27
52          25
64          25
 85         25
88          24
3           22
76          19
Name: count, dtype: int64

In [13]:
students.isna().sum()

student_id          0
first_name          0
last_name           0
age                 0
major               0
enrollment_date     0
course_grade       32
gpa                94
tuition_paid       21
dtype: int64

In [14]:
students['course_grade'] = students['course_grade'].replace('N/A', np.nan)

In [15]:
students.duplicated().sum()
#checks for duplicated rows
students = students.drop_duplicates()
#removes duplicated rows

In [16]:
students['first_name'].str.strip()

0      Taylor
1      Olivia
2       Priya
3       Priya
4        Noah
        ...
345    Taylor
346       Sam
347      Evan
348     Aisha
349       Ben
Name: first_name, Length: 350, dtype: object

In [21]:
students['major'] = students['major'].str.strip().str.capitalize()
students['major'] = students['major'].replace({
'Comp sci' : 'Computer science',
'Cs' : 'Computer science',
'Bio' :  'Biology',
'Psych' : 'Psychology'
})

In [23]:
students['major'].value_counts()

major
Computer science    118
Biology             117
Psychology          115
Name: count, dtype: int64

In [ ]:
students['course_grade'] = students['course_grade'].str.strip()
students.loc[students['course_grade'] == ' ninety', 'course_grade'] = 90

In [28]:
students['age'].value_counts(dropna=False)
students['age'] = pd.to_numeric(students['age'], errors = 'coerce')

In [35]:
students['age'].describe()

count    345.000000
mean      52.617391
std       20.951321
min       17.000000
25%       33.000000
50%       52.000000
75%       71.000000
max       89.000000
Name: age, dtype: float64

In [36]:
students.loc[students['age'] < 5, 'age'] = np.nan
students.loc[students['age'] > 120, 'age'] = np.nan

In [39]:
#create a column combining first and last names
students['full_name'] = students['first_name'] + ' ' + students['last_name']
students['full_name']

0              Taylor Chen
1          Olivia Martinez
2             Priya Garcia
3           Priya Anderson
4              Noah Wilson
                ...
346             Sam  Davis
347          Evan Martinez
348            Aisha Brown
349           Ben Martinez
 ninety                NaN
Name: full_name, Length: 351, dtype: object

In [42]:
students['age_group'] = pd.cut(
    students['age'],
    bins=[0, 25, 40, 65], 
    labels=['Young Adults', 'Working Adults', 'Retired']
    )

In [46]:
students[['age','age_group']].value_counts()

age   age_group
32.0  Working Adults    11
33.0  Working Adults     9
17.0  Young Adults       8
39.0  Working Adults     8
35.0  Working Adults     8
49.0  Retired            8
52.0  Retired            7
28.0  Working Adults     7
29.0  Working Adults     7
55.0  Retired            7
45.0  Retired            6
50.0  Retired            6
61.0  Retired            6
24.0  Young Adults       6
65.0  Retired            6
63.0  Retired            6
21.0  Young Adults       5
26.0  Working Adults     5
22.0  Young Adults       5
40.0  Working Adults     5
54.0  Retired            5
46.0  Retired            5
20.0  Young Adults       4
30.0  Working Adults     4
19.0  Young Adults       4
51.0  Retired            4
48.0  Retired            4
42.0  Retired            4
41.0  Retired            4
25.0  Young Adults       4
62.0  Retired            3
23.0  Young Adults       3
31.0  Working Adults     3
59.0  Retired            3
58.0  Retired            3
43.0  Retired            3
56.0  Retired            3
37.0  Working Adults     3
36.0  Working Adults     3
34.0  Working Adults     3
44.0  Retired            3
53.0  Retired            3
18.0  Young Adults       2
47.0  Retired            2
38.0  Working Adults     2
64.0  Retired            2
60.0  Retired            2
27.0  Working Adults     1
57.0  Retired            1
Name: count, dtype: int64

In [ ]:
students['cost_per_semester'] = students['tuition_paid'] / 3

In [48]:
students['cost_per_semester']

0          5849.366667
1          4376.376667
2          6350.453333
3          5747.536667
4                  NaN
              ...
346        6029.273333
347        6666.666667
348        4540.526667
349        4727.023333
 ninety            NaN
Name: cost_per_semester, Length: 351, dtype: float64

In [50]:
students['enrollment_date'] = pd.to_datetime(students['enrollment_date'])

ValueError: time data "January 30, 2024" doesn't match format "%Y-%m-%d", at position 1. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [ ]:
students.to_csv('../student_reports_clean.csv', index=False)
#save clean data as new csv

In [ ]:
students.plot.hist(column='age')